## Plans :thumbsup:

Outputs can be viewed in the Terrateam Console [here](https://app.terrateam.io/i/64340904/runs/9b532e48-cd3a-4844-a3b4-1a1ec5c512f4).

## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>


## Dir: . | Success :thumbsup:
**Dir**: .
**Workspace**: default
**Success**: :thumbsup:

**Step**: plan
**Success**: :thumbsup:
**Command**: `terraform plan -detailed-exitcode -out /tmp/tmpvsr1nnzp/plan`
```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_api_gateway_method.weather_get has been deleted
-   resource "aws_api_gateway_method" "weather_get" {
-       http_method          = "GET" -> null
        id                   = "agm-5fa7xm30gb-lkzyz8-GET"
        # (7 unchanged attributes hidden)
    }

  # aws_api_gateway_method_response.weather_response has been deleted
-   resource "aws_api_gateway_method_response" "weather_response" {
        id                  = "agmr-5fa7xm30gb-lkzyz8-GET-200"
-       status_code         = "200" -> null
        # (5 unchanged attributes hidden)
    }

  # aws_api_gateway_resource.weather_resource has been deleted
-   resource "aws_api_gateway_resource" "weather_resource" {
-       id          = "lkzyz8" -> null
        # (4 unchanged attributes hidden)
    }

  # aws_api_gateway_rest_api.mock_api has been deleted
-   resource "aws_api_gateway_rest_api" "mock_api" {
-       id                           = "5fa7xm30gb" -> null
        name                         = "MockWeatherAPI"
-       root_resource_id             = "raik4r0g5g" -> null
        tags                         = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-   destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_deployment.mock_api must be replaced
+/- resource "aws_api_gateway_deployment" "mock_api" {
!       created_date  = "2025-04-12T07:06:45Z" -> (known after apply)
!       execution_arn = "arn:aws:execute-api:eu-west-1:***:5fa7xm30gb/" -> (known after apply)
!       id            = "eby8z3" -> (known after apply)
!       invoke_url    = "https://5fa7xm30gb.execute-api.eu-west-1.amazonaws.com/" -> (known after apply)
!       rest_api_id   = "5fa7xm30gb" # forces replacement -> (known after apply) # forces replacement
    }

  # aws_api_gateway_deployment.mock_api (deposed object 425a57de) will be destroyed
  # (left over from a partially-failed replacement of this instance)
-   resource "aws_api_gateway_deployment" "mock_api" {
-       created_date  = "2025-04-12T06:57:05Z" -> null
-       execution_arn = "arn:aws:execute-api:eu-west-1:***:5fa7xm30gb/test" -> null
-       id            = "0tqdyo" -> null
-       invoke_url    = "https://5fa7xm30gb.execute-api.eu-west-1.amazonaws.com/test" -> null
-       rest_api_id   = "5fa7xm30gb" -> null
-       stage_name    = "test" -> null
    }

  # aws_api_gateway_integration.weather_integration will be created
+   resource "aws_api_gateway_integration" "weather_integration" {
+       cache_namespace      = (known after apply)
+       connection_type      = "INTERNET"
+       http_method          = "GET"
+       id                   = (known after apply)
+       passthrough_behavior = (known after apply)
+       request_templates    = {
+           "application/json" = jsonencode(
                {
+                   statusCode = 200
                }
            )
        }
+       resource_id          = (known after apply)
+       rest_api_id          = (known after apply)
+       timeout_milliseconds = 29000
+       type                 = "MOCK"
    }

  # aws_api_gateway_integration_response.weather_integration_response will be created
+   resource "aws_api_gateway_integration_response" "weather_integration_response" {
+       http_method        = "GET"
+       id                 = (known after apply)
+       resource_id        = (known after apply)
+       response_templates = {
+           "application/json" = jsonencode(
                {
+                   forecast     = "Sunny"
+                   mock_message = "Mock API response for testing"
+                   temperature  = "22C"
                }
            )
        }
+       rest_api_id        = (known after apply)
+       status_code        = "200"
    }

  # aws_api_gateway_method.weather_get will be created
+   resource "aws_api_gateway_method" "weather_get" {
+       api_key_required   = true
+       authorization      = "NONE"
+       http_method        = "GET"
+       id                 = (known after apply)
+       request_parameters = {
+           "method.request.header.X-Api-Key" = true
        }
+       resource_id        = (known after apply)
+       rest_api_id        = (known after apply)
    }

  # aws_api_gateway_method_response.weather_response will be created
+   resource "aws_api_gateway_method_response" "weather_response" {
+       http_method     = "GET"
+       id              = (known after apply)
+       resource_id     = (known after apply)
+       response_models = {
+           "application/json" = "Empty"
        }
+       rest_api_id     = (known after apply)
+       status_code     = "200"
    }

  # aws_api_gateway_resource.weather_resource will be created
+   resource "aws_api_gateway_resource" "weather_resource" {
+       id          = (known after apply)
+       parent_id   = (known after apply)
+       path        = (known after apply)
+       path_part   = "weather"
+       rest_api_id = (known after apply)
    }

  # aws_api_gateway_rest_api.mock_api will be created
+   resource "aws_api_gateway_rest_api" "mock_api" {
+       api_key_source               = (known after apply)
+       arn                          = (known after apply)
+       binary_media_types           = (known after apply)
+       created_date                 = (known after apply)
+       description                  = "Mock API for testing Lambda with Doppler secret"
+       disable_execute_api_endpoint = (known after apply)
+       execution_arn                = (known after apply)
+       id                           = (known after apply)
+       minimum_compression_size     = (known after apply)
+       name                         = "MockWeatherAPI"
+       policy                       = (known after apply)
+       root_resource_id             = (known after apply)
+       tags_all                     = (known after apply)
    }

  # aws_api_gateway_stage.test_stage will be created
+   resource "aws_api_gateway_stage" "test_stage" {
+       arn           = (known after apply)
+       deployment_id = (known after apply)
+       execution_arn = (known after apply)
+       id            = (known after apply)
+       invoke_url    = (known after apply)
+       rest_api_id   = (known after apply)
+       stage_name    = "test"
+       tags_all      = (known after apply)
+       web_acl_arn   = (known after apply)
    }

  # aws_api_gateway_usage_plan.mock_api_usage_plan will be created
+   resource "aws_api_gateway_usage_plan" "mock_api_usage_plan" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       name     = "mock-api-usage-plan"
+       tags_all = (known after apply)

+       api_stages {
+           api_id = (known after apply)
+           stage  = "test"
        }
    }

  # aws_api_gateway_usage_plan_key.mock_api_usage_plan_key will be created
+   resource "aws_api_gateway_usage_plan_key" "mock_api_usage_plan_key" {
+       id            = (known after apply)
+       key_id        = "i2e7gbm9nj"
+       key_type      = "API_KEY"
+       name          = (known after apply)
+       usage_plan_id = (known after apply)
+       value         = (known after apply)
    }

  # aws_lambda_function.mock_api_lambda will be updated in-place
!   resource "aws_lambda_function" "mock_api_lambda" {
        id                             = "mock-api-test-function"
!       last_modified                  = "2025-04-12T06:57:05.943+0000" -> (known after apply)
!       source_code_hash               = "ZpV5qe+dW6ETxV/8sBIb4bcICOnahSfDYdG06nOifCw=" -> "jLSrEPvBOZCZ8oQPwZbmUeUSK3SLvozllqajRRXAJ0k="
        tags                           = {}
        # (22 unchanged attributes hidden)

!       environment {
!           variables = {
-               "MOCK_API_KEY" = (sensitive value)
-               "MOCK_API_URL" = "https://5fa7xm30gb.execute-api.eu-west-1.amazonaws.com/test/weather"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 10 to add, 1 to change, 2 to destroy.

Changes to Outputs:
!   mock_api_url        = "https://5fa7xm30gb.execute-api.eu-west-1.amazonaws.com/test/weather" -> (known after apply)

```

</details>

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| . | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
